fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПлановыеОтпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПодсветкуПревышения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ОбновитьПодсветкуПревышения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", ПоместитьОтпускаВоВременноеХранилище());
	ПараметрыФормы.Вставить("ГодГрафика", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПодсветкуПревышения()
	
	ИмяОформления = "ВКМ_ПревышениеОтпуска";
	
	// Удаляем ранее добавленное оформление.
	КоллекцияОформления = УсловноеОформление.Элементы;
	Для Индекс = 1 По КоллекцияОформления.Количество() Цикл
		ЭлементОформления = КоллекцияОформления[КоллекцияОформления.Количество() - Индекс];
		Если ЭлементОформления.Представление = ИмяОформления Тогда
			КоллекцияОформления.Удалить(ЭлементОформления);
		КонецЕсли;
	КонецЦикла;
	
	// Считаем дни отпуска по каждому сотруднику.
	ДнейПоСотрудникам = Новый Соответствие;
	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл
		Если Не ЗначениеЗаполнено(СтрокаОтпуска.Сотрудник)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания)
			Или СтрокаОтпуска.ДатаОкончания < СтрокаОтпуска.ДатаНачала Тогда
			Продолжить;
		КонецЕсли;
		Дней = (НачалоДня(СтрокаОтпуска.ДатаОкончания) - НачалоДня(СтрокаОтпуска.ДатаНачала)) / 86400 + 1;
		ТекущееКоличество = ДнейПоСотрудникам[СтрокаОтпуска.Сотрудник];
		Если ТекущееКоличество = Неопределено Тогда
			ТекущееКоличество = 0;
		КонецЕсли;
		ДнейПоСотрудникам.Вставить(СтрокаОтпуска.Сотрудник, ТекущееКоличество + Дней);
	КонецЦикла;
	
	СотрудникиСПревышением = Новый СписокЗначений;
	Для Каждого ЭлементСоответствия Из ДнейПоСотрудникам Цикл
		Если ЭлементСоответствия.Значение > МаксимумДнейОтпуска() Тогда
			СотрудникиСПревышением.Добавить(ЭлементСоответствия.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если СотрудникиСПревышением.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = ИмяОформления;
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = СотрудникиСПревышением;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПредупреждения);
	
	Для Каждого Колонка Из Элементы.ОтпускаСотрудников.ПодчиненныеЭлементы Цикл
		ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МаксимумДнейОтпуска()
	
	Возврат 28;
	
КонецФункции

&НаСервере
Функция ПоместитьОтпускаВоВременноеХранилище()
	
	Отпуска = Объект.ОтпускаСотрудников.Выгрузить(, "Сотрудник, ДатаНачала, ДатаОкончания");
	Возврат ПоместитьВоВременноеХранилище(Отпуска, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
